diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ПериодОбработки</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_АбонентскаяПлата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция СозданиеРеализацийЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	// Из задания я понял что одна реализация в месяц. Потому учитывая что период может быть больше месяца
	// создадим массив периодов для удобства.  
	
	МассивПериодов = Новый Массив;
	ТекущийПериод = ДатаНачала;
	Пока ТекущийПериод < ДатаОкончания Цикл
		НовыйПериод = Новый СтандартныйПериод(НачалоМесяца(ТекущийПериод), КонецМесяца(ТекущийПериод));
		МассивПериодов.Добавить(НовыйПериод);
		ТекущийПериод = ДобавитьМесяц(ТекущийПериод, 1);
	КонецЦикла; 
	
	ТабРеализаций = Новый ТаблицаЗначений;
	ТабРеализаций.Колонки.Добавить("Договор");
	ТабРеализаций.Колонки.Добавить("ДокументРеализации");
	
	///А теперь пройдемся по периодам. 
	Для Каждого ТекПериод Из МассивПериодов Цикл
		
		// Сначала проверим есть ли уже реализации по договорам за период. Вторые не нужны.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Ссылка КАК Договор
			|ПОМЕСТИТЬ Договоры
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Реализация
			|ПОМЕСТИТЬ Реализации
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Договоры.Договор.Организация КАК Организация,
			|	Договоры.Договор.Владелец КАК Контрагент,
			|	Договоры.Договор КАК Договор,
			|	Реализации.Реализация КАК Реализация
			|ИЗ
			|	Договоры КАК Договоры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации КАК Реализации
			|		ПО Договоры.Договор = Реализации.Реализация.Договор
			|ГДЕ
			|	Реализации.Реализация ЕСТЬ NULL";
	
		Запрос.УстановитьПараметр("ДатаНачала", ТекПериод.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ТекПериод.ДатаОкончания);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда  //Запрос пустой, значит по всем договорам реализации уже созданы.
			Продолжить;
		КонецЕсли;
		
		// Если нет, то создадим новую по каждому договору.
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			
			НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокументРеализации.Дата = ТекПериод.ДатаОкончания;
			НовыйДокументРеализации.Организация   = Выборка.Организация;
			НовыйДокументРеализации.Контрагент    = Выборка.Контрагент;
			НовыйДокументРеализации.Договор       = Выборка.Договор;
			НовыйДокументРеализации.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение();
			Если НовыйДокументРеализации.Услуги.Количество()>0 Тогда // Если в табличной части что-то есть, то запишем документ. 
				Попытка	
					НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
					
					НовСтрока = ТабРеализаций.Добавить();
					НовСтрока.Договор = Выборка.Договор;
					НовСтрока.ДокументРеализации = НовыйДокументРеализации.Ссылка;
				Исключение
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат ТабРеализаций;
	
КонецФункции

#КонецОбласти
